wimalopaan/wmucpp/include_stm32/usart.h
//                 static inline void startSend(const uint8_t n = Config::Tx::size) requires(!std::is_same_v<dmaChRW, void>) {
//                     rxEnable<false>();
//                     dmaChRW::startWrite(n, (uint32_t)&mcuUart->TDR, mActiveWriteBuffer, Uarts::Properties<N>::dmamux_tx_src);
//                     if (mActiveWriteBuffer == &mWriteBuffer1[0]) {
//                         mActiveWriteBuffer = &mWriteBuffer2[0];
//                     }
//                     else {
//                         mActiveWriteBuffer = &mWriteBuffer1[0];
//                     }
//                 }
//                 static inline auto outputBuffer() {
//                     return mActiveWriteBuffer;
//                 }
//                 static inline auto readBuffer() {
//                     return mActiveReadBuffer;
//                 }
//                 static inline uint16_t readCount() {
//                     return *mActiveReadCount;
//                 }
//                 struct Isr {
//                     static inline void onTransferComplete(const auto f) {
//                         if ((mcuUart->CR1 & USART_CR1_TE) && (mcuUart->ISR & USART_ISR_TC)) {
//                             mcuUart->ICR = USART_ICR_TCCF;
//                             f();
//                         }
//                     }
//                     static inline void onIdle(const auto f) requires(Config::Isr::idle && std::is_same_v<dmaChRW, void>){
//                         if (mcuUart->ISR & USART_ISR_IDLE) {
//                             mcuUart->ICR = USART_ICR_IDLECF;
//                             f();
//                         }
//                     }
//                     static inline void onIdle(const auto f) requires(Config::Isr::idle && !std::is_same_v<dmaChRW, void>) {
//                         // if constexpr(!std::is_same_v<tp, void>) {
//                         //     tp::set();
//                         // }
//                         if (mcuUart->ISR & USART_ISR_IDLE) {
//                             mcuUart->ICR = USART_ICR_IDLECF;
//                             if (const uint16_t nRead = (Config::Rx::size - dmaChRW::mcuDmaChannel->CNDTR); nRead >= Config::Rx::idleMinSize) {
//                                 dmaChRW::reConfigure([&]{
//                                     if (dmaChRW::mcuDmaChannel->CMAR == (uint32_t)&mReadBuffer1[0]) {
//                                         dmaChRW::mcuDmaChannel->CMAR = (uint32_t)&mReadBuffer2[0];
//                                         mActiveReadBuffer = &mReadBuffer1[0];
//                                         mCount1 = nRead;
//                                         mActiveReadCount = &mCount1;
//                                     }
//                                     else {
//                                         dmaChRW::mcuDmaChannel->CMAR = (uint32_t)&mReadBuffer1[0];
//                                         mActiveReadBuffer = &mReadBuffer2[0];
//                                         mCount2 = nRead;
//                                         mActiveReadCount = &mCount2;
//                                     }
//                                     dmaChRW::mcuDmaChannel->CNDTR = Config::Rx::size;
//                                 });
//                                 mBufferHasData = true;
//                                 f();
//                             }
//                         }
//                         // if constexpr(!std::is_same_v<tp, void>) {
//                         //     tp::reset();
//                         // }
//                     }
//                 };
//                 template<bool Disable = true>
//                 static inline void baud(const uint32_t baud) {
//                     const auto [brr, presc] = calcBRR(baud);
//                     if constexpr(Disable) {
//                         mcuUart->CR1 &= ~USART_CR1_UE;
//                     }
//                     if constexpr ((N == 101) || (N == 102)) {
//                         mcuUart->PRESC = presc;
//                         mcuUart->BRR = brr;
//                     }
//                     else {
//                         mcuUart->BRR = brr;
//                     }
//                     if constexpr(Disable) {
//                         mcuUart->CR1 |= USART_CR1_UE;
//                     }
//                 }
//                 static inline void periodic() {
//                     const auto [hasData, count] = Mcu::Arm::Atomic::access([]{
//                         return std::pair{std::exchange(mBufferHasData, false), readCount()};
//                     });
//                     if (hasData) {
//                         for(uint16_t i = 0; i < count; ++i) {
//                             adapter::process(mActiveReadBuffer[i]);
//                         }
//                     }
//                 }

//                 private:

//                 static inline constexpr auto calcBRR(const uint32_t baud) {
//                     std::pair<uint32_t, uint32_t> brrPresc{0, 0};
//                     if constexpr ((N == 101) || (N == 102)) {
//                         brrPresc.first = (16 * static_cast<Units::hertz>(clock_t::config::f).value) / baud;
//                         brrPresc.second = 0b0111; // 16
//                     }
//                     else {
//                         brrPresc.first  = static_cast<Units::hertz>(clock_t::config::f).value / baud;
//                     }
//                     return brrPresc;
//                 }
//                 static inline std::array<storage_t, Config::Rx::size> mReadBuffer1;
//                 static inline std::array<storage_t, Config::Rx::size> mReadBuffer2;
//                 static inline storage_t* volatile mActiveReadBuffer = &mReadBuffer1[0];
//                 static inline volatile uint16_t mCount1 = 0;
//                 static inline volatile uint16_t mCount2 = 0;
//                 static inline volatile uint16_t* volatile mActiveReadCount = &mCount1;
//                 static inline bool volatile mBufferHasData = false;
//                 static inline std::array<storage_t, Config::Tx::size> mWriteBuffer1;
//                 static inline std::array<storage_t, Config::Tx::size> mWriteBuffer2;
//                 static inline storage_t* volatile mActiveWriteBuffer = &mWriteBuffer1[0];
//             };
//     }

    namespace V2 {

        template<uint8_t N, typename Config, typename MCU = DefaultMcu>
        struct Uart;

        template<uint8_t N, typename Config, typename MCU = DefaultMcu>
        using LpUart = Uart<N + 100, Config, MCU>;

        template<uint8_t N, typename Config, typename MCU>
            requires (
                        ((N >= 1) && (N <= 2) && std::is_same_v<Stm32G030, MCU>) ||
                        ((N >= 1) && (N <= 6) && std::is_same_v<Stm32G0B1, MCU>) ||
                        ((N >= 1) && (N <= 3) && std::is_same_v<Stm32G431, MCU>) ||
                        ((N >= 1) && (N <= 5) && std::is_same_v<Stm32G473, MCU>) ||
                        ((N == 101)) ||
                        ((N == 102))
                    )
            struct Uart<N, Config, MCU> {
                static inline constexpr uint8_t number = N;

                using component_t = Mcu::Components::Usart<N>;

                using value_t = Config::ValueType;
                using storage_t = volatile value_t;
                using clock_t = Config::Clock;
                static inline constexpr auto size = Config::size;
                static inline constexpr auto minSize = Config::minSize;

                using dmaChRead  = Config::DmaChannelRead;
                using dmaChWrite = Config::DmaChannelWrite;
                using dmaChRW = std::conditional_t<std::is_same_v<dmaChRead, dmaChWrite>, dmaChRead, void>;

                static inline constexpr bool useDmaTCIsr = Config::useDmaTCIsr;

                static inline constexpr bool useIdleIsr = Config::useIdleIsr;
                static inline constexpr bool useRxToIsr = Config::useRxToIsr;
                static inline constexpr uint16_t rxToCount = Config::rxToCount;

                using adapter = Config::Adapter;

                using tp = Config::Debug::tp;

