wimalopaan/wmucpp/include_stm32/usart.h
                    mcuUart->CR1 |= USART_CR1_RE;
                    mcuUart->CR1 |= USART_CR1_TE;
                    mcuUart->CR1 |= USART_CR1_UE;
                }
    #endif
                static inline void dmaSetupWrite(const size_t s, const uint32_t adr) requires(std::is_same_v<dmaChRead, dmaChWrite>) {
                    using dmaChRW = dmaChWrite;
                    dmaChRW::init();
                    dmaChRW::template msize<value_t>();
                    dmaChRW::template psize<value_t>();
                    dmaChRW::mcuDmaChannel->CNDTR = s;
                    dmaChRW::mcuDmaChannel->CCR |= DMA_CCR_MINC;
                    dmaChRW::mcuDmaChannel->CCR |= DMA_CCR_DIR;
                    if constexpr(useDmaTCIsr) {
                        dmaChRW::mcuDmaChannel->CCR |= DMA_CCR_TCIE;
                    }
                    else {
                        dmaChRW::mcuDmaChannel->CCR &= ~DMA_CCR_TCIE;
                    }

                    dmaChRW::mcuDmaChannel->CPAR = (uint32_t)&mcuUart->TDR;
                    dmaChRW::mcuDmaChannel->CMAR = adr;
                    MODIFY_REG(dmaChRW::mcuDmaMux->CCR, DMAMUX_CxCR_DMAREQ_ID_Msk,
                               Uarts::Properties<N>::dmamux_tx_src << DMAMUX_CxCR_DMAREQ_ID_Pos);
                }
                static inline void dmaSetupRead(const size_t s) requires(std::is_same_v<dmaChRead, dmaChWrite>) {
                    // using dmaChRW = dmaChRead;
                    dmaChRW::init();
                    dmaChRW::template msize<value_t>();
                    dmaChRW::template psize<value_t>();
                    dmaChRW::mcuDmaChannel->CNDTR = s;
                    dmaChRW::mcuDmaChannel->CCR |= DMA_CCR_MINC;
                    dmaChRW::mcuDmaChannel->CCR &= ~DMA_CCR_DIR;
                    dmaChRW::mcuDmaChannel->CPAR = (uint32_t)&mcuUart->RDR;
                    dmaChRW::mcuDmaChannel->CMAR = (uint32_t)&mReadBuffer1[0];
                    MODIFY_REG(dmaChRW::mcuDmaMux->CCR, DMAMUX_CxCR_DMAREQ_ID_Msk,
                               Uarts::Properties<N>::dmamux_rx_src << DMAMUX_CxCR_DMAREQ_ID_Pos);
                }
                static inline void dmaSetupRead2(const size_t s) requires(std::is_same_v<dmaChRead, dmaChWrite>) {
                    // using dmaChRW = dmaChRead;
                    dmaChRW::mcuDmaChannel->CNDTR = s;
                    dmaChRW::mcuDmaChannel->CCR &= ~DMA_CCR_DIR;
                    dmaChRW::mcuDmaChannel->CPAR = (uint32_t)&mcuUart->RDR;
                    dmaChRW::mcuDmaChannel->CMAR = (uint32_t)&mReadBuffer1[0];
                    MODIFY_REG(dmaChRW::mcuDmaMux->CCR, DMAMUX_CxCR_DMAREQ_ID_Msk,
                               Uarts::Properties<N>::dmamux_rx_src << DMAMUX_CxCR_DMAREQ_ID_Pos);
                }

                static inline void onTransferComplete(const auto f) {
                    if ((mcuUart->CR1 & USART_CR1_TE) && (mcuUart->ISR & USART_ISR_TC)) {
                        mcuUart->ICR = USART_ICR_TCCF;
                        f();
                    }
                }
                static inline void onIdle(const auto f) {
                    if (mcuUart->ISR & USART_ISR_IDLE) {
                        mcuUart->ICR = USART_ICR_IDLECF;
                        f();
                    }
                }
                static inline void onParityError(const auto f) {
                    if (mcuUart->ISR & USART_ISR_PE) {
                        mcuUart->ICR = USART_ICR_PECF;
                        f();
                    }
                }
                static inline void onParityGood(const auto f) {
                    if (mcuUart->ISR & USART_ISR_PE) {
                        mcuUart->ICR = USART_ICR_PECF;
                    }
                    else {
                        f();
                    }
                }
                static inline void onIdleWithDma(const auto f) requires(!std::is_same_v<dmaChRead, void> && std::is_same_v<dmaChWrite, void>) {
                    if (mcuUart->ISR & USART_ISR_IDLE) {
                        mcuUart->ICR = USART_ICR_IDLECF;
                        if (const uint16_t nRead = (size - dmaChRead::mcuDmaChannel->CNDTR); nRead >= minSize) {
                            mCount = nRead;
                            f();
                        }
                    }
                }
                static inline void onIdleWithDma(const auto f) requires(std::is_same_v<dmaChRead, dmaChWrite>) {
                    if (mcuUart->ISR & USART_ISR_IDLE) {
                        mcuUart->ICR = USART_ICR_IDLECF;
                        if constexpr(std::is_same_v<dmaChRead, dmaChWrite>) {
                            if (const uint16_t nRead = (size - dmaChRead::mcuDmaChannel->CNDTR); nRead > minSize) {
                                mCount = nRead;
                                f();
                            }
                        }
                    }
                }
                template<bool Enable>
                static inline void txEnable() {
                    if constexpr (Enable) {
                        mcuUart->CR1 |= USART_CR1_TE;
                    }
                    else {
                        mcuUart->CR1 &= ~USART_CR1_TE;
                    }
                }
                template<bool Enable>
                static inline void rxEnable() {
                    if constexpr (Enable) {
                        mBufferHasData = false;
                        mcuUart->CR1 |= USART_CR1_RE;
                    }
                    else {
                        mcuUart->CR1 &= ~USART_CR1_RE;
                    }
                }
                static inline void rxClear() {
                    mcuUart->RQR = USART_RQR_RXFRQ;
                }
                template<bool Enable = true>
                static inline void halfDuplex() {
                    mcuUart->CR1 &= ~USART_CR1_UE;
                    if constexpr(Enable) {
                        mcuUart->CR3 |= USART_CR3_HDSEL;
                    }
                    else {
                        mcuUart->CR3 &= ~USART_CR3_HDSEL;
                    }
                    mcuUart->CR1 |= USART_CR1_UE;
                }
                template<bool Enable = true>
                static inline void enableTCIsr() {
                    mcuUart->CR1 &= ~USART_CR1_UE;
                    if constexpr(Enable) {
                        mcuUart->CR1 |= USART_CR1_TCIE;
                    }
                    else {
                        mcuUart->CR1 &= ~USART_CR1_TCIE;
                    }
                    mcuUart->CR1 |= USART_CR1_UE;
                }
                static inline void dmaReenable(const auto f) requires(std::is_same_v<dmaChRead, dmaChWrite>){
                    using dmaChRW = dmaChRead;
                    dmaChRW::reenable(f);
                }
                static inline void startSend(const uint8_t n = size) {
                    if constexpr(std::is_same_v<dmaChRead, dmaChWrite>) {
                        using dmaChRW = dmaChRead;
                        dmaChRW::enable(false);
                        dmaChRW::clearTransferCompleteIF();
                        dmaSetupWrite(n, (uint32_t)mActiveWriteBuffer);
                        if (mActiveWriteBuffer == &mWriteBuffer1[0]) {
                            mActiveWriteBuffer = &mWriteBuffer2[0];
                        }
                        else {
                            mActiveWriteBuffer = &mWriteBuffer1[0];
                        }
                        dmaChRW::enable(true);
                    }
                    else {
                        dmaChWrite::reenable([&]{
                            dmaChWrite::mcuDmaChannel->CNDTR = n;
                            dmaChWrite::mcuDmaChannel->CMAR = (uint32_t)mActiveWriteBuffer;
                            if (mActiveWriteBuffer == &mWriteBuffer1[0]) {
                                mActiveWriteBuffer = &mWriteBuffer2[0];
                            }
                            else {
                                mActiveWriteBuffer = &mWriteBuffer1[0];
                            }
                        });
                    }
                }
                static inline void dmaDisable() {
                    dmaChWrite::enable(false);
                }
                static inline auto outputBuffer() {
                    return mActiveWriteBuffer;
                }
                static inline auto readBuffer() {
                    return mActiveReadBuffer;
                }
                static inline uint16_t readCount() {
                    return mCount;
                }
                static inline void isr() requires(useRxToIsr || useIdleIsr) {
                    auto reprogDma = []{
                        if constexpr(std::is_same_v<dmaChRead, dmaChWrite>) {
                            if (const uint16_t nRead = (size - dmaChRead::mcuDmaChannel->CNDTR); nRead >= minSize) {
                                mCount = nRead;
                                mBufferHasData = true;
                            }
                        }
                        else {
                            if (const uint16_t nRead = (size - dmaChRead::mcuDmaChannel->CNDTR); nRead >= minSize) {
                                mCount = nRead;
                                dmaChRead::reenable([&]{
                                    if (dmaChRead::mcuDmaChannel->CMAR == (uint32_t)&mReadBuffer1[0]) {
                                        dmaChRead::mcuDmaChannel->CMAR = (uint32_t)&mReadBuffer2[0];
                                        mActiveReadBuffer = &mReadBuffer1[0];
                                    }
                                    else {
                                        dmaChRead::mcuDmaChannel->CMAR = (uint32_t)&mReadBuffer1[0];
                                        mActiveReadBuffer = &mReadBuffer2[0];
                                    }
                                    dmaChRead::mcuDmaChannel->CNDTR = size;
                                });
                                mBufferHasData = true;
                            }
                        }
                    };
                    if (mcuUart->ISR & USART_ISR_RTOF) {
                        mcuUart->ICR = USART_ICR_RTOCF;
                        reprogDma();
                    }
                    if (mcuUart->ISR & USART_ISR_IDLE) {
                        mcuUart->ICR = USART_ICR_IDLECF;
                        reprogDma();
                    }
                }
                static inline void invert(const bool invert) {
                    mcuUart->CR1 &= ~USART_CR1_UE;
                    if (invert) {
                        mcuUart->CR2 |= (USART_CR2_TXINV | USART_CR2_RXINV);
                    }
                    else {
                        mcuUart->CR2 &= ~(USART_CR2_TXINV | USART_CR2_RXINV);
                    }
                    mcuUart->CR1 |= USART_CR1_UE;
                }
                static inline void parity(const bool even) {
                    mcuUart->CR1 &= ~USART_CR1_UE;
                    if (even) {
                        mcuUart->CR1 |= USART_CR1_PCE;
                        mcuUart->CR1 &= ~USART_CR1_PS;
                        mcuUart->CR1 |= USART_CR1_M0;
                    }
                    else {
                        mcuUart->CR1 |= USART_CR1_PCE;
                        mcuUart->CR1 |= USART_CR1_PS;
                        mcuUart->CR1 |= USART_CR1_M0;
                    }
                    mcuUart->CR1 |= USART_CR1_UE;
                }
                static inline void baud(const uint32_t baud) {
                    mcuUart->CR1 &= ~USART_CR1_UE;
                    if constexpr ((N == 101) || (N == 102)) {
                        mcuUart->PRESC = 0b0111; // 16
                        mcuUart->BRR = (16 * static_cast<Units::hertz>(clock_t::config::f).value) / baud;
                    }
                    else {
                        mcuUart->BRR = static_cast<Units::hertz>(clock_t::config::f).value / baud;
                    }
                    mcuUart->CR1 |= USART_CR1_UE;
                }
                static inline bool isIdle() {
                    return mcuUart->ISR & USART_ISR_TC;
                }
                static inline void onHasData(auto f) {
                    __disable_irq();
                    const bool hasData = std::exchange(mBufferHasData, false);
                    __enable_irq();
                    if (hasData) {
                        f();
                    }
                }
                static inline void periodic() {
                    onHasData([]{
                        adapter::reset();
                        analyze();
                    });
                    // __disable_irq();
                    // const bool hasData = std::exchange(mBufferHasData, false);
                    // __enable_irq();
                    // if (hasData) {
                    //     tp::set();
                    //     adapter::reset();
                    //     analyze();
                    //     tp::reset();
                    // }
                }

