wimalopaan/wmucpp/include_stm32/usart.h
                private:
                static inline void analyze() {
                    for(uint16_t i = 0; i < mCount; ++i) {
                        adapter::process(mActiveReadBuffer[i]);
                    }
                }

                static inline std::array<storage_t, size> mReadBuffer1;
                static inline std::array<storage_t, size> mReadBuffer2;
                static inline storage_t* volatile mActiveReadBuffer = &mReadBuffer1[0];
                static inline volatile uint16_t mCount = 0;
                static inline bool volatile mBufferHasData = false;
                static inline std::array<storage_t, size> mWriteBuffer1;
                static inline std::array<storage_t, size> mWriteBuffer2;
                static inline storage_t* volatile mActiveWriteBuffer = &mWriteBuffer1[0];
            };
    }

    inline
    namespace V1 {

    template<uint8_t N, typename PA, auto Size, typename ValueType, typename Clock, typename MCU = DefaultMcu>
    struct Uart;

    template<uint8_t N, typename PA, auto Size, typename ValueType, typename Clock, typename MCU = DefaultMcu>
    using LpUart = Uart<N + 100, PA, Size, ValueType, Clock, MCU>;

    template<uint8_t N, typename PA, auto Size, typename ValueType, typename Clock, typename MCU>
        requires (
                    ((N >= 1) && (N <= 2) && std::is_same_v<Stm32G030, MCU>) ||
                    ((N >= 1) && (N <= 6) && std::is_same_v<Stm32G0B1, MCU>) ||
                    ((N >= 1) && (N <= 3) && std::is_same_v<Stm32G431, MCU>) ||
                    ((N >= 1) && (N <= 5) && std::is_same_v<Stm32G473, MCU>)) || (N == 101)
        struct Uart<N, PA, Size, ValueType, Clock, MCU> {
            using pa_t = PA;

            static inline /*constexpr */ USART_TypeDef* const mcuUart = reinterpret_cast<USART_TypeDef*>(Mcu::Stm::Address<Mcu::Components::Usart<N>>::value);

            static inline constexpr uint8_t QueueLength{ Size };
            static inline constexpr bool useInterrupts{ false };

#ifdef STM32G4
            static inline void init() {
                if constexpr (N == 1) {
                    RCC->APB2ENR |= RCC_APB2ENR_USART1EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_USART1SEL_Pos;
                }
                else if constexpr (N == 2) {
                    RCC->APB1ENR1 |= RCC_APB1ENR1_USART2EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_USART2SEL_Pos;
                }
                else if constexpr (N == 3) {
                    RCC->APB1ENR1 |= RCC_APB1ENR1_USART3EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_USART3SEL_Pos;
                }
                else if constexpr (N == 4) {
                    RCC->APB1ENR1 |= RCC_APB1ENR1_UART4EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_UART4SEL_Pos;
                }
#ifdef STM32G473xx
                else if constexpr (N == 5) {
                    RCC->APB1ENR1 |= RCC_APB1ENR1_UART5EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_UART5SEL_Pos;
                }
#endif
                else if constexpr (N == 101) {
                    RCC->APB1ENR2 |= RCC_APB1ENR2_LPUART1EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_LPUART1SEL_Pos;
                }
                else {
                    static_assert(false);
                }
                mcuUart->PRESC = 0;
                mcuUart->CR1 |= USART_CR1_FIFOEN;
                mcuUart->CR1 |= USART_CR1_RE;
                mcuUart->CR1 |= USART_CR1_TE;
                mcuUart->CR1 |= USART_CR1_UE;
            }
#endif
#ifdef STM32G0
            static inline void init() {
                if constexpr (N == 1) {
                    RCC->APBENR2 |= RCC_APBENR2_USART1EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_USART1SEL_Pos;
                }
                else if constexpr (N == 2) {
                    RCC->APBENR1 |= RCC_APBENR1_USART2EN;
#ifdef STM32G0B1xx
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_USART2SEL_Pos;
#endif
                }
#ifdef STM32G0B1xx
                else if constexpr (N == 3) {
                    RCC->APBENR1 |= RCC_APBENR1_USART3EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_USART3SEL_Pos;
                }
                else if constexpr (N == 4) {
                    RCC->APBENR1 |= RCC_APBENR1_USART4EN;
                }
                else if constexpr (N == 5) {
                    RCC->APBENR1 |= RCC_APBENR1_USART5EN;
                }
                else if constexpr (N == 6) {
                    RCC->APBENR1 |= RCC_APBENR1_USART6EN;
                }
                else if constexpr (N == 101) {
                    RCC->APBENR1 |= RCC_APBENR1_LPUART1EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_LPUART1SEL_Pos;
                }
                else if constexpr (N == 102) {
                    RCC->APBENR1 |= RCC_APBENR1_LPUART2EN;
                    RCC->CCIPR |= 0x01 << RCC_CCIPR_LPUART2SEL_Pos;
                }
#endif
                else {
                    static_assert(false);
                }
                if constexpr(N == 1) {
                    mcuUart->CR1 |= USART_CR1_FIFOEN;
                }
#ifdef STM32G0B1xx
                if constexpr((N == 2) || (N == 3)) {
                    mcuUart->CR1 |= USART_CR1_FIFOEN;
                }
#endif
                mcuUart->CR3 |= USART_CR3_OVRDIS;
                mcuUart->CR1 |= USART_CR1_RE;
                mcuUart->CR1 |= USART_CR1_TE;
                mcuUart->CR1 |= USART_CR1_UE;
            }
#endif
            template<bool Enable>
            static inline void rxEnable() {
                if constexpr (Enable) {
                    mcuUart->CR1 |= USART_CR1_RE;
                }
                else {
                    mcuUart->CR1 &= ~USART_CR1_RE;
                }
            }

            template<bool Enable = true>
            static inline void halfDuplex() {
                mcuUart->CR1 &= ~USART_CR1_UE;
                if constexpr (Enable) {
                    mcuUart->CR3 |= USART_CR3_HDSEL;
                }
                else {
                    mcuUart->CR3 &= ~USART_CR3_HDSEL;
                }
                mcuUart->CR1 |= USART_CR1_UE;
            }

            static inline void parity(const bool even) {
                mcuUart->CR1 &= ~USART_CR1_UE;
                if (even) {
                    mcuUart->CR1 |= USART_CR1_PCE;
                    mcuUart->CR1 &= ~USART_CR1_PS;
                    mcuUart->CR1 |= USART_CR1_M0;
                }
                else {
                    mcuUart->CR1 |= USART_CR1_PCE;
                    mcuUart->CR1 |= USART_CR1_PS;
                    mcuUart->CR1 |= USART_CR1_M0;
                }
                mcuUart->CR1 |= USART_CR1_UE;
            }
            static inline void parityOff() {
                mcuUart->CR1 &= ~USART_CR1_UE;
                mcuUart->CR1 &= ~USART_CR1_M0;
                mcuUart->CR1 &= ~USART_CR1_PCE;
                mcuUart->CR1 |= USART_CR1_UE;
            }

            static inline void rxtxswap(const bool swap) {
                mcuUart->CR1 &= ~USART_CR1_UE;
                if (swap) {
                    mcuUart->CR2 |= USART_CR2_SWAP;
                }
                else {
                    mcuUart->CR2 &= ~(USART_CR2_SWAP);
                }
                mcuUart->CR1 |= USART_CR1_UE;
            }

            static inline void stop(const uint8_t) {
                mcuUart->CR1 &= ~USART_CR1_UE;
                MODIFY_REG(mcuUart->CR2, USART_CR2_STOP_Msk, 0b10 << USART_CR2_STOP_Pos);
                mcuUart->CR1 |= USART_CR1_UE;
            }

            static inline void invert(const bool invert) {
                mcuUart->CR1 &= ~USART_CR1_UE;
                if (invert) {
                    mcuUart->CR2 |= (USART_CR2_TXINV | USART_CR2_RXINV);
                }
                else {
                    mcuUart->CR2 &= ~(USART_CR2_TXINV | USART_CR2_RXINV);
                }
                mcuUart->CR1 |= USART_CR1_UE;
            }

            static inline void baud(const uint32_t baud) {
                mcuUart->CR1 &= ~USART_CR1_UE;
                if constexpr ((N == 101) || (N == 102)) {
                    mcuUart->PRESC = 0b0111; // 16
                    mcuUart->BRR = (16 * static_cast<Units::hertz>(Clock::config::f).value) / baud;
                }
                else {
                    mcuUart->BRR = static_cast<Units::hertz>(Clock::config::f).value / baud;
                }
                mcuUart->CR1 |= USART_CR1_UE;
            }

