wimalopaan/wmucpp/include_stm32/usart.h
            static inline ValueType put(const ValueType c) {
                mSendData.push_back(c);
                return c;
            }

            static inline std::optional<ValueType> get() {
                return mReceiveData.pop_front();
            }

            static inline bool isIdle() {
                return mcuUart->ISR & USART_ISR_TC;
            }

            static inline bool isTxQueueEmpty() {
                return mSendData.empty();
            }

            static inline void clear() {
                mSendData.clear();
                mReceiveData.clear();
            }


            static inline void periodic() {
                if (mcuUart->ISR & USART_ISR_TXE_TXFNF) {
                    if (!mSendData.empty()) {
                        mcuUart->TDR = uint8_t(*mSendData.pop_front());
                        // Byte access of USART registers not allowed according to ref-manual
                        // may be "accessed" only by 32bit words
                        //                    *(uint8_t*)(&mcuUart->TDR) = *mSendData.pop_front();
                    }
                }
                if (mcuUart->ISR & USART_ISR_RXNE_RXFNE) {
                    if constexpr (std::is_same_v<PA, void>) {
                        mReceiveData.push_back(ValueType(mcuUart->RDR));
                    }
                    else {
                        PA::process(std::byte(mcuUart->RDR));
                    }
                }
            }
            private:
            static inline etl::FiFo<ValueType, Size> mSendData;
            static inline etl::FiFo<ValueType, Size> mReceiveData;
        };
    }
    template<>
    struct Address<Mcu::Components::Usart<1>> {
        static inline constexpr uintptr_t value = USART1_BASE;
    };
    template<>
    struct Address<Mcu::Components::Usart<2>> {
        static inline constexpr uintptr_t value = USART2_BASE;
    };
#if defined(STM32G4)
    template<>
    struct Address<Mcu::Components::Usart<3>> {
        static inline constexpr uintptr_t value = USART3_BASE;
    };
    template<>
    struct Address<Mcu::Components::Usart<4>> {
        static inline constexpr uintptr_t value = UART4_BASE;
    };
#if defined(STM32G473xx)
    template<>
    struct Address<Mcu::Components::Usart<5>> {
        static inline constexpr uintptr_t value = UART5_BASE;
    };
#endif
    template<>
    struct Address<Mcu::Components::Usart<101>> {
        static inline constexpr uintptr_t value = LPUART1_BASE;
    };
#endif
#if defined(STM32G0B1xx)
    template<>
    struct Address<Mcu::Components::Usart<3>> {
        static inline constexpr uintptr_t value = USART3_BASE;
    };
    template<>
    struct Address<Mcu::Components::Usart<4>> {
        static inline constexpr uintptr_t value = USART4_BASE;
    };
    template<>
    struct Address<Mcu::Components::Usart<5>> {
        static inline constexpr uintptr_t value = USART5_BASE;
    };
    template<>
    struct Address<Mcu::Components::Usart<6>> {
        static inline constexpr uintptr_t value = USART6_BASE;
    };
    template<>
    struct Address<Mcu::Components::Usart<101>> {
        static inline constexpr uintptr_t value = LPUART1_BASE;
    };
    template<>
    struct Address<Mcu::Components::Usart<102>> {
        static inline constexpr uintptr_t value = LPUART2_BASE;
    };
#endif
}
